content/programming/repositories.org
#+startup: content indent

[[file:../index.org][Giovanni's Diary]] > [[file:../subjects.org][Subjects]] > [[file:programming.org][Programming]] >

* My public repositories
#+INDEX: Giovanni's Diary!Programming!My public repositories

Here is a list of my public repositories, with a brief description.
** Highlights

- [[https://github.com/San7o/Brenta-Engine][Brenta Engine]]: a 3D renderer and game engine in modern C++, with a custom ECS framework. [[https://san7o.github.io/brenta-engine-documentation/v1.1/][website]]
  - Satellite projects:
    - [[https://github.com/San7o/valfuzz][valfuzz]]: modern testing and fuzzing library. [[https://san7o.github.io/brenta-engine-documentation/valfuzz/v1.0/][website]]
    - [[https://github.com/San7o/viotecs][viotecs]]: the engine's ECS. [[https://san7o.github.io/brenta-engine-documentation/viotecs/v1.0/][website]]
    - [[https://github.com/San7o/oak][oak]]: a feature-rich thread-safe C++23 logger library. [[https://san7o.github.io/brenta-engine-documentation/oak/v1.0/][website]]
- [[https://github.com/San7o/kivebpf][kivebpf]]: eBPF-powered file access monitoring Kubernetes operator
  - [[https://san7o.github.io/kivebpf/][The Kibebpf website]]: more documentation about the operator
- [[https://github.com/San7o/haplolang][haplolang]]: a Lisp-like, s-expression based, imperative, strongly typed programming language
  - [[https://san7o.github.io/haplolang/][The Design and Implementation of Haplolang]]: my notes after implementing the language
- [[https://github.com/San7o/Baldo-Scanner][Baldo scanner]]: malware scanner daemon for linux using a kernel module
- [[https://github.com/San7o/tenno-tl][tenno-tl]]: a partial re-implementation of the c++26 standard library

** [[https://github.com/San7o/micro-headers][micro-headers]]

A collection of high-quality, configurable, header-only libraries written in C99. The libraries are designed to be highly reusable, simple to maintain with little to no dependencies, and easy to integrate in your projects. [[https://san7o.github.io/micro-headers/][website]]

- [[https://github.com/San7o/micro-tests.h][micro-tests.h]]: lightweight testing framework, with multithread support and run-time settings
- [[https://github.com/San7o/micro-log.h][micro-log.h]]: configurable, thread safe logging framework in C99. With lots of features
- [[https://github.com/San7o/micro-draw.h][micro-draw.h]]: a 2D software renderer
  - Projects that use this renderer: [[https://github.com/San7o/cosu][cosu]], [[https://github.com/San7o/cgis][cgis]], [[https://san7o.github.io/micro-draw.h/#canvas][game-of-life]] (wasm)
- [[https://github.com/San7o/micro-lex.h][micro-lex.h]]: simple lexer for lisp-like languages, and others. See also [[https://github.com/San7o/justlex-rs][justlex-rs]] [[https://crates.io/crates/justlex][crates.io]]
- [[https://github.com/San7o/micro-arena.h/][micro-arena.h]]: memory allocator (first fit). It implements the common memory functions from stdlib.h.
- [[https://github.com/San7o/micro-flag.h/][micro-flag.h]]: tiny library to parse command line arguments
- [[https://github.com/San7o/micro-module.h][micro-module.h]]: define, load, and unload runtime modules / plugins with a simple C99 API
- [[https://github.com/San7o/micro-serde.h][micro-serde.h]]: serialization library for C99, in ~150 lines of code.
- [[https://github.com/San7o/micro-bench.h][micro-bench.h]]: micro benchmarking library
- [[https://github.com/San7o/micro-conf.h][micro-conf.h]]: library to parse config files
- [[https://github.com/San7o/micro-hash.h][micro-hash.h]]: quick and dirty hash functions in C99, with some benchmarks
- [[https://github.com/San7o/micro-la.h.git][micro-la.h]]: linear algebra types and functions
- [[https://github.com/San7o/hll.h][hll.h]]: configurable, header-only implementation of HyperLogLog, used for approximating the cardinality of large multisets
- [[https://github.com/San7o/bloom-filter.h][bloom-filter.h]]: configurable, header-only implementation of bloom filters, a space-efficient probabilistic data structure that is used to test whether an element is a member of a set
- [[https://github.com/San7o/rendezvous-hasher.h][rendezvous-hasher.h]]: dependency-free implementation of Rendezvous Hashing (a.k.a. Highest Random Weight hashing), useful for distributing keys across a dynamic set of nodes
- [[https://github.com/San7o/consistent-hasher.h][consistent-hasher.h]]: implementation of consistent hashing, alternative to rendezvous-hashing
- [[https://github.com/San7o/hashmap.h][hashmap.h]]: implementation of an hashmap for any type
- [[https://github.com/San7o/hashset.h][hashset.h]]: implementation of an hashset for any type
- [[https://github.com/San7o/llist.h][llist.h]]: type-safe, generic doubly-linked list in C99
- [[https://github.com/San7o/liblaunchpad.h][liblaunchpad.h]]: abstraction layer over Novation's Launchpad S through ALSA, as an header-only C99 library
- [[https://github.com/San7o/micro-example.h][micro-example.h]]: example header-only library in C99 used as a template project, in the style of the great micro-headers
- [[https://github.com/San7o/game-of-life.h/][game-of-life.h]]: Conway's Game of Life logic implementation

Related projects:

- [[https://github.com/San7o/micro-style.css/][micro-style.css]]: minimal, simple, tunable style for your websites
- [[https://github.com/San7o/micro-website][micro-website]]: generate a static website from markdown files
- [[https://github.com/San7o/micro-templating.c/][micro-templating.c]]: generate a file from a template, in ~200 lines of code
- [[https://github.com/San7o/micro-timerd/][micro-timerd]]: client-server application to start, stop and list timers
- [[https://github.com/San7o/micro-audio.c/][micro-audio.c]]: tiny wrapper over miniaudio for managing audio sounds and streams
- [[https://github.com/San7o/micro-sprite][micro-sprite]]: simple drawing tool.
- [[https://github.com/San7o/lkde-tool][lkde-tool]]: develop and test kernel patches and applications in multiple kernel branches, trees, architectures and configurations.
- [[https://github.com/San7o/xorcrypt.rs][xorcrypt.rs]]: encrypt / decrypt files with XOR encryption
- [[https://github.com/San7o/mapkg][mapkg]]: my packet manager

