public/programming/repositories.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../subjects.html">Subjects</a> &gt; <a href="programming.html">Programming</a> &gt;
</p>
<div id="outline-container-org80c4434" class="outline-2">
<h2 id="org80c4434">My public repositories</h2>
<div class="outline-text-2" id="text-org80c4434">
<p>
Here is a list of my public repositories, with a brief description.
</p>
</div>
<div id="outline-container-orgbec03ed" class="outline-3">
<h3 id="orgbec03ed">Highlights</h3>
<div class="outline-text-3" id="text-orgbec03ed">
<ul class="org-ul">
<li><a href="https://github.com/San7o/Brenta-Engine">Brenta Engine</a>: a 3D renderer and game engine in modern C++, with a custom ECS framework. <a href="https://san7o.github.io/brenta-engine-documentation/v1.1/">website</a>
<ul class="org-ul">
<li>Satellite projects:
<ul class="org-ul">
<li><a href="https://github.com/San7o/valfuzz">valfuzz</a>: modern testing and fuzzing library. <a href="https://san7o.github.io/brenta-engine-documentation/valfuzz/v1.0/">website</a></li>
<li><a href="https://github.com/San7o/viotecs">viotecs</a>: the engine's ECS. <a href="https://san7o.github.io/brenta-engine-documentation/viotecs/v1.0/">website</a></li>
<li><a href="https://github.com/San7o/oak">oak</a>: a feature-rich thread-safe C++23 logger library. <a href="https://san7o.github.io/brenta-engine-documentation/oak/v1.0/">website</a></li>
</ul></li>
</ul></li>
<li><a href="https://github.com/San7o/kivebpf">kivebpf</a>: eBPF-powered file access monitoring Kubernetes operator
<ul class="org-ul">
<li><a href="https://san7o.github.io/kivebpf/">The Kibebpf website</a>: more documentation about the operator</li>
</ul></li>
<li><a href="https://github.com/San7o/haplolang">haplolang</a>: a Lisp-like, s-expression based, imperative, strongly typed programming language
<ul class="org-ul">
<li><a href="https://san7o.github.io/haplolang/">The Design and Implementation of Haplolang</a>: my notes after implementing the language</li>
</ul></li>
<li><a href="https://github.com/San7o/Baldo-Scanner">Baldo scanner</a>: malware scanner daemon for linux using a kernel module</li>
<li><a href="https://github.com/San7o/tenno-tl">tenno-tl</a>: a partial re-implementation of the c++26 standard library</li>
</ul>
</div>
</div>
<div id="outline-container-orge9bddf8" class="outline-3">
<h3 id="orge9bddf8"><a href="https://github.com/San7o/micro-headers">micro-headers</a></h3>
<div class="outline-text-3" id="text-orge9bddf8">
<p>
A collection of high-quality, configurable, header-only libraries written in C99. The libraries are designed to be highly reusable, simple to maintain with little to no dependencies, and easy to integrate in your projects. <a href="https://san7o.github.io/micro-headers/">website</a>
</p>

<ul class="org-ul">
<li><a href="https://github.com/San7o/micro-tests.h">micro-tests.h</a>: lightweight testing framework, with multithread support and run-time settings</li>
<li><a href="https://github.com/San7o/micro-log.h">micro-log.h</a>: configurable, thread safe logging framework in C99. With lots of features</li>
<li><a href="https://github.com/San7o/micro-draw.h">micro-draw.h</a>: a 2D software renderer
<ul class="org-ul">
<li>Projects that use this renderer: <a href="https://github.com/San7o/cosu">cosu</a>, <a href="https://github.com/San7o/cgis">cgis</a>, <a href="https://san7o.github.io/micro-draw.h/#canvas">game-of-life</a> (wasm)</li>
</ul></li>
<li><a href="https://github.com/San7o/micro-lex.h">micro-lex.h</a>: simple lexer for lisp-like languages, and others. See also <a href="https://github.com/San7o/justlex-rs">justlex-rs</a> <a href="https://crates.io/crates/justlex">crates.io</a></li>
<li><a href="https://github.com/San7o/micro-arena.h/">micro-arena.h</a>: memory allocator (first fit). It implements the common memory functions from stdlib.h.</li>
<li><a href="https://github.com/San7o/micro-flag.h/">micro-flag.h</a>: tiny library to parse command line arguments</li>
<li><a href="https://github.com/San7o/micro-module.h">micro-module.h</a>: define, load, and unload runtime modules / plugins with a simple C99 API</li>
<li><a href="https://github.com/San7o/micro-serde.h">micro-serde.h</a>: serialization library for C99, in ~150 lines of code.</li>
<li><a href="https://github.com/San7o/micro-bench.h">micro-bench.h</a>: micro benchmarking library</li>
<li><a href="https://github.com/San7o/micro-conf.h">micro-conf.h</a>: library to parse config files</li>
<li><a href="https://github.com/San7o/micro-hash.h">micro-hash.h</a>: quick and dirty hash functions in C99, with some benchmarks</li>
<li><a href="https://github.com/San7o/micro-la.h.git">micro-la.h</a>: linear algebra types and functions</li>
<li><a href="https://github.com/San7o/hll.h">hll.h</a>: configurable, header-only implementation of HyperLogLog, used for approximating the cardinality of large multisets</li>
<li><a href="https://github.com/San7o/bloom-filter.h">bloom-filter.h</a>: configurable, header-only implementation of bloom filters, a space-efficient probabilistic data structure that is used to test whether an element is a member of a set</li>
<li><a href="https://github.com/San7o/rendezvous-hasher.h">rendezvous-hasher.h</a>: dependency-free implementation of Rendezvous Hashing (a.k.a. Highest Random Weight hashing), useful for distributing keys across a dynamic set of nodes</li>
<li><a href="https://github.com/San7o/consistent-hasher.h">consistent-hasher.h</a>: implementation of consistent hashing, alternative to rendezvous-hashing</li>
<li><a href="https://github.com/San7o/hashmap.h">hashmap.h</a>: implementation of an hashmap for any type</li>
<li><a href="https://github.com/San7o/hashset.h">hashset.h</a>: implementation of an hashset for any type</li>
<li><a href="https://github.com/San7o/llist.h">llist.h</a>: type-safe, generic doubly-linked list in C99</li>
<li><a href="https://github.com/San7o/liblaunchpad.h">liblaunchpad.h</a>: abstraction layer over Novation's Launchpad S through ALSA, as an header-only C99 library</li>
<li><a href="https://github.com/San7o/micro-example.h">micro-example.h</a>: example header-only library in C99 used as a template project, in the style of the great micro-headers</li>
<li><a href="https://github.com/San7o/game-of-life.h/">game-of-life.h</a>: Conway's Game of Life logic implementation</li>
</ul>

<p>
Related projects:
</p>

<ul class="org-ul">
<li><a href="https://github.com/San7o/micro-style.css/">micro-style.css</a>: minimal, simple, tunable style for your websites</li>
<li><a href="https://github.com/San7o/micro-website">micro-website</a>: generate a static website from markdown files</li>
<li><a href="https://github.com/San7o/micro-templating.c/">micro-templating.c</a>: generate a file from a template, in ~200 lines of code</li>
<li><a href="https://github.com/San7o/micro-timerd/">micro-timerd</a>: client-server application to start, stop and list timers</li>
<li><a href="https://github.com/San7o/micro-audio.c/">micro-audio.c</a>: tiny wrapper over miniaudio for managing audio sounds and streams</li>
<li><a href="https://github.com/San7o/micro-sprite">micro-sprite</a>: simple drawing tool.</li>
<li><a href="https://github.com/San7o/lkde-tool">lkde-tool</a>: develop and test kernel patches and applications in multiple kernel branches, trees, architectures and configurations.</li>
<li><a href="https://github.com/San7o/xorcrypt.rs">xorcrypt.rs</a>: encrypt / decrypt files with XOR encryption</li>
<li><a href="https://github.com/San7o/mapkg">mapkg</a>: my packet manager</li>
</ul>
</div>
</div>
