content/programming/repositories.org
** Demos
Projects showcasing how to use various technologies.

- [[https://github.com/San7o/fft.c][fft.c]]: implementation of Discrete Fourier Transform (DFT) and Fast Fourier Transform (FFT) in C99, with a bonus cool music visualization.
- [[https://github.com/San7o/povOS][povOS]]: x86_64 bare metal playground and bootloader 
- [[https://github.com/San7o/ld-preload-sample][ld-preload-sample]]: sample LD_PRELOAD demonstration to replace libc functions
- [[https://github.com/San7o/ebpf-c-sample][ebpf-c-sample]]: sample project for an eBPF program + loader in C with libbpf and clang
- [[https://github.com/San7o/opentelemetry-cpp-sample][opentelemetry-cpp-sample]]: sample C++ application with OpenTelemetry instrumentation to emit telemetry data
- [[https://github.com/San7o/linux-kernel-module][linux-kernel-module]]: hello world kernel module with a full developement setup using qemu
- [[https://github.com/San7o/micro-gl-sample][micro-gl-sample]]: simple setup project for OpenGL graphics.
- [[https://github.com/San7o/x509-examples][x509-examples]]: examples for generating and storing an RSA key pair and a self-signed x509 certificate (RFC 5980), in C and Go
- [[https://github.com/San7o/go-chat-server?tab=readme-ov-file][go-chat-server]]: a server and client for a minimal text-based chat in Go
- [[https://github.com/San7o/elixir-simple-bockchain][elixir-blockchain]]: a simple blockchain library implemented in elixir.
- [[https://github.com/San7o/santOS][santOS]]: a general purpose microkernel for i386.

** Misc

- [[https://github.com/San7o/minipiano.c][minipiano.c]]: play the piano using sinewaves and your keyboard!
- [[https://github.com/San7o/cosu][cosu!]]: a rhythm game written in C, (not yet fully) compatible with osu!mania maps.
- [[https://github.com/San7o/snakepp][snakepp]]: simple demo of snake in C++, using SFML
- [[https://github.com/San7o/Introduction-to-machine-learning][Introduction-to-machine-learning]]: useful notes for students studying for an introductionary course to Machine Learning, or to anyone interested in the subject
- [[https://github.com/San7o/design-patterns-cpp.git][design-patterns-cpp]]: implementation of common design patterns in C++, useful reference for many projects
- [[https://github.com/San7o/modern-cpp-template][modern-cpp-template]]: a template for c++ libraries
- [[https://github.com/San7o/parallel-computing-cpp][parallel-computing-cpp]]: MPI and OpenMP algorithms and benchmarks
- [[https://github.com/San7o/cycloidal-curves/][cycloidal-curves]]: cycloidal curves interactive visualization. [[https://san7o.github.io/cycloidal-curves/][website]]
- [[https://github.com/orgs/IS-FixMi/repositories][fixmi]]: business management software using microservices.
  - [[https://github.com/IS-FixMi/FixMi][documentation]]
  - [[https://github.com/IS-FixMi/fixmi-compose][root-project]]
- [[https://github.com/San7o/repo-graph/][repo-graph]]: visualize GitHub repositories through a graph based on their topics.
- [[https://giovanni-diary.netlify.app/programming/notes/algoritmi/algoritmi][Algorithms and Data Structure course (Italian)]]: high quality notes from my Algorithms university course
- [[https://github.com/San7o/react-express-template][react-express-template]]: a meplate for web applications using node, express, typescript, react, tailwind, docker.
- [[https://github.com/San7o/webgl-3D-renderer][webgl-3D-renderer]]: a 3D renderer in WebGL and Angular
- [[https://github.com/San7o/tiny-rss.git][tiny-rss]]: RSS feeds generator for org mode
- [[https://github.com/San7o/musync.el.git][musync]]: download music declaratively
- [[https://github.com/San7o/ssap][ssap]]: local password encryption manager written in in Rust
- [[https://github.com/San7o/rust-little-computer-3][rust-lc3]]: implementation of a virtual machine for [[https://en.wikipedia.org/wiki/Little_Computer_3][LC-3]]
- [[https://github.com/San7o/rust-robotUI][robotUI]]: bevy visualizer for Advanced Programming 2023 @Unitn
- [[https://github.com/San7o/rust-pomodoro][rust-pomodoro-timer]]: TUI study timer written in Rust
- [[https://github.com/San7o/rust-music-player][rust-music-player]]: a TUI music player written in Rust
- [[https://github.com/San7o/broutines][broutines]]: goroutines and coroutines implemented in C
- [[https://github.com/San7o/stock-exchange-py][stock-exchange-py]]: simple logic implementation of a stock exchange in Python.
- [[https://github.com/San7o/chttps][chttps]]: https server in C with server-side rendering
- [[https://github.com/San7o/cchecker][cchecker]]: borrow checker in C++
- [[https://github.com/San7o/regEZ][regEZ]]: fully constexpr regex implementation in modern C++
- [[https://github.com/San7o/go-ebpf][go-ebpf]]: example eBPF program in go
- [[https://github.com/San7o/risto89-fork][risto89]]: online tickets market in java
- [[https://github.com/San7o/ledger-board][ledger-board]]: highly scalable transaction producer/consumer app, built with Kubernetes, Kafka, Django, Angular, Nginx, Redis, Celery, Docker
- [[https://github.com/San7o/how-to-root-samsung-galaxy-j5][how-to-root-samsung-galaxy-j5]]: instructions to root a Samsung Galaxy J5
- [[https://github.com/San7o/hypr-nerd-gestures][hypr-nerd-gestures]]: control hyprland through hand gestures, using openCV
- [[https://github.com/San7o/launchpad-app-launcher][launchpad-app-launcher]]: launch commands from a novation's launchpad
- [[https://github.com/San7o/modern-python-template][modern-python-template]]
- [[https://github.com/San7o/youtube-miniature-generator][youtube-minuature-generator]]
- many more...

