public/programming/repositories.html
<div id="outline-container-orge1089bb" class="outline-3">
<h3 id="orge1089bb">Demos</h3>
<div class="outline-text-3" id="text-orge1089bb">
<p>
Projects showcasing how to use various technologies.
</p>

<ul class="org-ul">
<li><a href="https://github.com/San7o/fft.c">fft.c</a>: implementation of Discrete Fourier Transform (DFT) and Fast Fourier Transform (FFT) in C99, with a bonus cool music visualization.</li>
<li><a href="https://github.com/San7o/povOS">povOS</a>: x86_64 bare metal playground and bootloader</li>
<li><a href="https://github.com/San7o/ld-preload-sample">ld-preload-sample</a>: sample LD_PRELOAD demonstration to replace libc functions</li>
<li><a href="https://github.com/San7o/ebpf-c-sample">ebpf-c-sample</a>: sample project for an eBPF program + loader in C with libbpf and clang</li>
<li><a href="https://github.com/San7o/opentelemetry-cpp-sample">opentelemetry-cpp-sample</a>: sample C++ application with OpenTelemetry instrumentation to emit telemetry data</li>
<li><a href="https://github.com/San7o/linux-kernel-module">linux-kernel-module</a>: hello world kernel module with a full developement setup using qemu</li>
<li><a href="https://github.com/San7o/micro-gl-sample">micro-gl-sample</a>: simple setup project for OpenGL graphics.</li>
<li><a href="https://github.com/San7o/x509-examples">x509-examples</a>: examples for generating and storing an RSA key pair and a self-signed x509 certificate (RFC 5980), in C and Go</li>
<li><a href="https://github.com/San7o/go-chat-server?tab=readme-ov-file">go-chat-server</a>: a server and client for a minimal text-based chat in Go</li>
<li><a href="https://github.com/San7o/elixir-simple-bockchain">elixir-blockchain</a>: a simple blockchain library implemented in elixir.</li>
<li><a href="https://github.com/San7o/santOS">santOS</a>: a general purpose microkernel for i386.</li>
</ul>
</div>
</div>
<div id="outline-container-orgec3f8b5" class="outline-3">
<h3 id="orgec3f8b5">Misc</h3>
<div class="outline-text-3" id="text-orgec3f8b5">
<ul class="org-ul">
<li><a href="https://github.com/San7o/minipiano.c">minipiano.c</a>: play the piano using sinewaves and your keyboard!</li>
<li><a href="https://github.com/San7o/cosu">cosu!</a>: a rhythm game written in C, (not yet fully) compatible with osu!mania maps.</li>
<li><a href="https://github.com/San7o/snakepp">snakepp</a>: simple demo of snake in C++, using SFML</li>
<li><a href="https://github.com/San7o/Introduction-to-machine-learning">Introduction-to-machine-learning</a>: useful notes for students studying for an introductionary course to Machine Learning, or to anyone interested in the subject</li>
<li><a href="https://github.com/San7o/design-patterns-cpp.git">design-patterns-cpp</a>: implementation of common design patterns in C++, useful reference for many projects</li>
<li><a href="https://github.com/San7o/modern-cpp-template">modern-cpp-template</a>: a template for c++ libraries</li>
<li><a href="https://github.com/San7o/parallel-computing-cpp">parallel-computing-cpp</a>: MPI and OpenMP algorithms and benchmarks</li>
<li><a href="https://github.com/San7o/cycloidal-curves/">cycloidal-curves</a>: cycloidal curves interactive visualization. <a href="https://san7o.github.io/cycloidal-curves/">website</a></li>
<li><a href="https://github.com/orgs/IS-FixMi/repositories">fixmi</a>: business management software using microservices.
<ul class="org-ul">
<li><a href="https://github.com/IS-FixMi/FixMi">documentation</a></li>
<li><a href="https://github.com/IS-FixMi/fixmi-compose">root-project</a></li>
</ul></li>
<li><a href="https://github.com/San7o/repo-graph/">repo-graph</a>: visualize GitHub repositories through a graph based on their topics.</li>
<li><a href="https://giovanni-diary.netlify.app/programming/notes/algoritmi/algoritmi">Algorithms and Data Structure course (Italian)</a>: high quality notes from my Algorithms university course</li>
<li><a href="https://github.com/San7o/react-express-template">react-express-template</a>: a meplate for web applications using node, express, typescript, react, tailwind, docker.</li>
<li><a href="https://github.com/San7o/webgl-3D-renderer">webgl-3D-renderer</a>: a 3D renderer in WebGL and Angular</li>
<li><a href="https://github.com/San7o/tiny-rss.git">tiny-rss</a>: RSS feeds generator for org mode</li>
<li><a href="https://github.com/San7o/musync.el.git">musync</a>: download music declaratively</li>
<li><a href="https://github.com/San7o/ssap">ssap</a>: local password encryption manager written in in Rust</li>
<li><a href="https://github.com/San7o/rust-little-computer-3">rust-lc3</a>: implementation of a virtual machine for <a href="https://en.wikipedia.org/wiki/Little_Computer_3">LC-3</a></li>
<li><a href="https://github.com/San7o/rust-robotUI">robotUI</a>: bevy visualizer for Advanced Programming 2023 @Unitn</li>
<li><a href="https://github.com/San7o/rust-pomodoro">rust-pomodoro-timer</a>: TUI study timer written in Rust</li>
<li><a href="https://github.com/San7o/rust-music-player">rust-music-player</a>: a TUI music player written in Rust</li>
<li><a href="https://github.com/San7o/broutines">broutines</a>: goroutines and coroutines implemented in C</li>
<li><a href="https://github.com/San7o/stock-exchange-py">stock-exchange-py</a>: simple logic implementation of a stock exchange in Python.</li>
<li><a href="https://github.com/San7o/chttps">chttps</a>: https server in C with server-side rendering</li>
<li><a href="https://github.com/San7o/cchecker">cchecker</a>: borrow checker in C++</li>
<li><a href="https://github.com/San7o/regEZ">regEZ</a>: fully constexpr regex implementation in modern C++</li>
<li><a href="https://github.com/San7o/go-ebpf">go-ebpf</a>: example eBPF program in go</li>
<li><a href="https://github.com/San7o/risto89-fork">risto89</a>: online tickets market in java</li>
<li><a href="https://github.com/San7o/ledger-board">ledger-board</a>: highly scalable transaction producer/consumer app, built with Kubernetes, Kafka, Django, Angular, Nginx, Redis, Celery, Docker</li>
<li><a href="https://github.com/San7o/how-to-root-samsung-galaxy-j5">how-to-root-samsung-galaxy-j5</a>: instructions to root a Samsung Galaxy J5</li>
<li><a href="https://github.com/San7o/hypr-nerd-gestures">hypr-nerd-gestures</a>: control hyprland through hand gestures, using openCV</li>
<li><a href="https://github.com/San7o/launchpad-app-launcher">launchpad-app-launcher</a>: launch commands from a novation's launchpad</li>
<li><a href="https://github.com/San7o/modern-python-template">modern-python-template</a></li>
<li><a href="https://github.com/San7o/youtube-miniature-generator">youtube-minuature-generator</a></li>
<li>many more&#x2026;</li>
</ul>
</div>
