public/programming/repositories.html
<div id="outline-container-org633525b" class="outline-4">
<h4 id="org633525b">Gists</h4>
<div class="outline-text-4" id="text-org633525b">
<p>
Code extracted from my other projects that can be easily reused, or implementation of simple algorithms.
</p>

<ul class="org-ul">
<li><a href="https://gist.github.com/San7o/4a2cfa08783ab55c10f7af5c93401e28">unix_server.c</a>: Create an unix socket server that reads data sent to it</li>
<li><a href="https://gist.github.com/San7o/4af3f058cd1508f9779a310aef75b9c6">inet_server.c</a>: Create an inet server that reads data sent to it</li>
<li><a href="https://gist.github.com/San7o/c933925bc8bc8beb493bc618c90e1cbf">set_signals.c</a>: Setup an handler for various POSIX signals</li>
<li><a href="https://gist.github.com/San7o/b80ee8e26fecda3bfaa113b12be470c5">sdl_window.c</a>: Create an SDL3 window and poll events</li>
<li><a href="https://gist.github.com/San7o/1c88efae81f499e5882d0f63104a228e">mmap_file.c</a>: Read a file's contents using mmap, faster than read(2). Neat optimization on POSIX systems</li>
<li><a href="https://gist.github.com/San7o/270736ae4c9215aeee80d4593156c003">traverse_dir.c</a>: Traverse a directory recursively and call handle_file on each file</li>
<li><a href="https://gist.github.com/San7o/e41c79a609aaf3385f133d309ec39922">djb2.c</a>: Simple hash function for strings</li>
<li><a href="https://gist.github.com/San7o/f979a38a4746990da527041d62da2d71">lcg.c</a>: LCG algorithm for fast pseudo random number generation</li>
<li><a href="https://gist.github.com/San7o/6660fde97f359b83040a4b762a978f14">utils.h</a>: Utility macros for C projects</li>
<li><a href="https://gist.github.com/San7o/2eea69c31a9f631253d2b9c72d9fe34a">mandelbrot.c</a>: Get the number of iterations of a point in the Mandelbrot set</li>
<li><a href="https://gist.github.com/San7o/b1161f85888bc09a995e1fb3f54f52da">left_space.c</a>: Get number of separator charactes from the left of a string in C99</li>
<li><a href="https://gist.github.com/San7o/0a7ab7492e521cb5decd0e4eac18b276">clear_screen.c</a>: Clear the terminal screen using ANSI control sequences</li>
<li><a href="https://gist.github.com/San7o/51807bdc9266241c76f15ac4247167db">delta_time.c</a>: Calculate the frame delta time and render a certain number of times per seconds in C99</li>
<li><a href="https://gist.github.com/San7o/dcf1373ecb1eaff9c6f70ec025d0fe90">time_sec.c</a>: Get the time in seconds in C</li>
<li><a href="https://gist.github.com/San7o/5f45fe794f76bb451b134a9332a9d4f2">xorshift_rng.c</a>: xorshift algorithm for generating pseudo random numbers</li>
<li><a href="https://gist.github.com/San7o/630a4c8a42ae5b914a4fe41b4f19e374">Makefile</a>: Simple Makefile template for C projects</li>
<li><a href="https://gist.github.com/San7o/25c16f1a069474581bda8b33aa5f8001">CMakeLists.txt</a>: Modern Cmake template for C++ projects</li>
<li><a href="https://gist.github.com/San7o/b4650e0b1be17cb9d1c8f853076165a7">windows-commands.ps1</a>: Useful Microsoft Windows commands</li>
<li><a href="https://gist.github.com/San7o/8fcf11f588c049442968ae39a0b34248">yt-dl-mp3.sh</a>: Download mp3 music from youtube</li>
<li><a href="https://gist.github.com/San7o/2bf2126df500a889957d3ceea204a60a">replace-string.sh</a>: Replace all occurrences of a string in all files recursively.</li>
<li><a href="https://gist.github.com/San7o/b648bbbe4f8da434d2d00e6e59a531c6">k-means.py</a>: Implementation of k-means clustering in Python</li>
<li><a href="https://gist.github.com/San7o/f5948a04ddecd93ece67e19e66f48fa6">scikit-sample.py</a>: Example of using a ML model with scikit-learn</li>
<li><a href="https://gist.github.com/San7o/f999651fa0f607dca7856d36c0362200">hello_world.asm</a>: Hello world x86-64 assembly on Linux</li>
<li><a href="https://gist.github.com/San7o/94481c7399ef7efde0a3f1f2f7ce91d2">black-and-white-screen.glsl</a>: Use picom and a glsl shader to render the screen black and white</li>
<li><a href="https://gist.github.com/San7o/ff86aa4143c7184c48e94a431580d00c">static-ip-over-ethernet</a>: Set a static ip on two computers connected via ethernet so that they can communicate</li>
<li><a href="https://gist.github.com/San7o/4bfe69a9e1eb251d5267d8b74ff73dda">knn.c</a>: Implementation of KNN for supervised learning classification on a one-dimensional dataset in C</li>
<li><a href="https://gist.github.com/San7o/da2efc84eb3e7c8bdbefbd540c8cfbea">perceptron.c</a>: Implementation of a perceptron for binary classification in C</li>
<li><a href="https://gist.github.com/San7o/a85d3bd5796bc6b5a488fd6e660029ec">generate-debuginfo</a>: Separate debuginfo and executable in two different files</li>
<li><a href="https://gist.github.com/San7o/4ebdc3d64a170278e463d71a3332cea7">gcc-print-definitions</a>: Print all the #define symbols and their values with gcc or clang</li>
<li><a href="https://gist.github.com/San7o/6b722e3313c7086f9b89ad39e6e50f6e">ohm-law</a>: Ohm's law cheatsheet</li>
<li><a href="https://gist.github.com/San7o/20c1e33cf9bd837a3487962fa76510fb">calling-conventions-x86-32-64</a>: Calling conventions for i386 and i686</li>
<li><a href="https://gist.github.com/San7o/10496ad588e3e956c145501f89d13886">sha1.c</a>: sha1 implementation from nginx (src/core/ngx_sha1.c)</li>
<li><a href="https://gist.github.com/San7o/d8803805c0829fb9cf208b4fcd0d6a63">md5.c</a>: md5 implementation from nginx (src/core/ngx_md5.c)</li>
</ul>
</div>
</div>
<div id="outline-container-orgf19a69d" class="outline-4">
<h4 id="orgf19a69d">Setup</h4>
<div class="outline-text-4" id="text-orgf19a69d">
<p>
Custom configurations for my daily development setup and workflow.
</p>

<ul class="org-ul">
<li><a href="https://github.com/San7o/.emacs.d.git">.emacs.d</a>: my emacs configuration</li>
<li><a href="https://github.com/San7o/dwm.git">dwm</a>: my fork of DWM and DWL</li>
<li><a href="https://github.com/San7o/home-lab">home-lab</a>: home lab experiments</li>
<li><a href="https://gist.github.com/San7o/2d5856a3c3de041091ee92d5488edf58">init.lua</a>: simple Neovim configuration without too much bloat</li>
<li><a href="https://gist.github.com/San7o/63bfb7f49153ebabb3a98e44e47e1182">i3config</a>: i3 configuration, I use it as a fallback</li>
<li><a href="https://github.com/San7o/lfs">lfs</a>: my Linux From Scratch distribution</li>
<li><a href="https://github.com/San7o/nixos-dotfiles">nixos-dotfiles</a>: my (outdated) nixos setup</li>
<li><a href="https://github.com/San7o/obsidian-chill-theme">obsidian-chill-theme</a>: my custom obsidian theme</li>
<li><a href="https://github.com/San7o/obsidian-advanced-slides-theme-chill">obsidian-advanced-slided-theme</a>: custom theme for obsidian advanced slides</li>
</ul>
</div>
</div>
<div id="outline-container-orgf869833" class="outline-4">
<h4 id="orgf869833">My Favourite libraries</h4>
<div class="outline-text-4" id="text-orgf869833">
<p>
These are the libraries that I use the most in my projects and that I find incredibly useful.
</p>

<ul class="org-ul">
<li><a href="https://github.com/ColleagueRiley/RGFW">RGFW</a> (C99): when you just want to open a window in a cross-platform way, love it!</li>
<li><a href="https://github.com/nothings/stb">stb headers</a> (C): great source of inspiration and knowledge. There are some other headers in the creator's website such as <a href="https://nothings.org/stb/stb_malloc.h">stb_malloc.c</a>.</li>
<li><a href="https://github.com/raysan5/raylib">raylib</a> (C99): simple 2D/3D graphics library</li>
<li><a href="https://github.com/San7o/micro-headers">micro-headers</a> (C99): my own cool libraries for all my other projects</li>
<li><a href="https://github.com/leovandriel/csynth">csynth</a> (C):  A simple synth in C, very fun to explore the code, It is somewhat unusual and enlightening.</li>
<li><a href="https://github.com/nakst/luigi">luigi</a> (C): single header GUI framework in C. It is absurdly simple and well written, amazing read.</li>
<li><a href="https://github.com/nginx/nginx">nginx</a> (C): even if it is not a library, each source file is well divided from the others so that you can copy paste almost everything in your projects!</li>
<li><a href="https://github.com/libsdl-org/SDL">SDL</a> (C): my goto library for writing desktop applications</li>
<li><a href="https://github.com/mackron/miniaudio">miniaudio</a> (C): my goto library to play and mix audio</li>
<li><a href="https://github.com/SFML/SFML">SFML</a> (c++17): another great multimedia library, more ideomatic for C++</li>
<li><a href="https://zulko.github.io/moviepy/index.html">moviepy</a> (Python): edit videos from python</li>
<li><a href="https://github.com/wren-lang/wren">wren</a> (C): the most elegantly implemented programming language I have ever seen</li>
</ul>
</div>
</div>
