content/programming/repositories.org
*** Minor Contributions

Minor contributions all over the interweb:

- https://github.com/riscv/riscv-opcodes/pull/375: Correct parse.py example
- https://github.com/ColleagueRiley/RGFW/pull/329: fix example program

There are many more which are not really interesting or are not public,
so I didn't mention them.

Check out my [[file:gists/gists.org][gists]].

-----

Travel: [[file:programming.org][Programming]], [[file:../theindex.org][Index]]
