public/programming/repositories.html
<div id="outline-container-orgc3ab80d" class="outline-4">
<h4 id="orgc3ab80d">Minor Contributions</h4>
<div class="outline-text-4" id="text-orgc3ab80d">
<p>
Minor contributions all over the interweb:
</p>

<ul class="org-ul">
<li><a href="https://github.com/riscv/riscv-opcodes/pull/375">https://github.com/riscv/riscv-opcodes/pull/375</a>: Correct parse.py example</li>
<li><a href="https://github.com/ColleagueRiley/RGFW/pull/329">https://github.com/ColleagueRiley/RGFW/pull/329</a>: fix example program</li>
</ul>

<p>
There are many more which are not really interesting or are not public,
so I didn't mention them.
</p>

<p>
Check out my <a href="gists/gists.html">gists</a>.
</p>

<hr />

<p>
Travel: <a href="programming.html">Programming</a>, <a href="../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
